app/Views/barangmasuk/viewdata.php

SELECT COUNT(*) AS `numrows`
FROM `detail_barangmasuk`
WHERE `detfaktur` = 'f01'
---
          <td align="center">
            <?php
            $db = \Config\Database::connect();
            $jumlahItem = $db->table('detail_barangmasuk')->where('detfaktur',$row['faktur'])->countAllResults();