app/Controllers/Barangkeluar.php

    public function cetakFaktur($faktur){
        $modelBarangKeluar = new ModelBarangKeluar();
        $modelDetail = new ModelDetailBarangKeluar();
        $modelPelanggan = new ModelPelanggan();

        $cekData = $modelBarangKeluar->find($faktur);
        $dataPelanggan = $modelPelanggan->find($cekData['idpel']);
---
SELECT *
FROM `barangkeluar`
WHERE `barangkeluar`.`faktur` = '1810230008'
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`pelid` = '0'