app/Controllers/Barang.php

    public function tambah()
    {
        $modelkategori = new Modelkategori();
        $modelsatuan = new Modelsatuan();

        $data =[
            'datakategori' => $modelkategori->findAll(),
            'datasatuan' => $modelsatuan->findAll()
        ];
---
SELECT *
FROM `kategori`
SELECT *
FROM `satuan`