app/Controllers/Barangmasuk.php

    public function data(){
        $tombolcari = $this->request->getPost('tombolcari');

        if(isset($tombolcari)){
            $cari = $this->request->getPost('cari');
            session()->set('cari_faktur',$cari);
            redirect()->to('/barangmasuk/data');
        }else{
            $cari = session()->get('cari_faktur');
        }

        $modelBarangMasuk = new Modelbarangmasuk();

        //method from modelbarang
        $totalData = $cari? $modelBarangMasuk->tampildata_cari($cari)->countAllResults() :$modelBarangMasuk->countAllResults();


        $databarangmasuk = $cari?$modelBarangMasuk->tampildata_cari($cari)->paginate(10,'barangmasuk') :$modelBarangMasuk->paginate(10,'barangmasuk');
---
SELECT COUNT(*) AS `numrows`
FROM `barangmasuk`
SELECT *
FROM `barangmasuk`
 LIMIT 10

    public function simpanDetail(){
        if($this->request->isAJAX()){
            $faktur = $this->request->getPost('faktur');
            $hargajual = $this->request->getPost('hargajual');
            $hargabeli = $this->request->getPost('hargabeli');
            $kdbarang = $this->request->getPost('kdbarang');
            $jumlah = $this->request->getPost('jumlah');

            $modelDetail = new Modeldetailbarangmasuk();
            $modelBarangMasuk = new Modelbarangmasuk();

            $modelDetail->insert([
             'detfaktur'=>$faktur,
             'detbrgkode'=>$kdbarang,
             'dethargamasuk'=>$hargabeli,
             'dethargajual'=>$hargajual,
             'detjml'=>$jumlah,
             'detsubtotal'=> intval($jumlah)* intval($hargabeli)
            ]);
---
INSERT INTO `detail_barangmasuk` (`detfaktur`, `detbrgkode`, `dethargamasuk`, `dethargajual`, `detjml`, `detsubtotal`) VALUES ('f03', 'KB010', '300000', '200000', '5', 1500000)

    public function hapusTransaksi()
    {
        if($this->request->isAJAX()){
            $faktur = $this->request->getPost('faktur');

            // $modelDetail = new Modeldetailbarangmasuk();
            $db = \Config\Database::connect();
            $modelBarangMasuk = new Modelbarangmasuk();

            // $modelDetail->hapusFaktur($faktur);
            $db->table('detail_barangmasuk')->delete(['detfaktur'=>$faktur]);
            $modelBarangMasuk->delete($faktur);
---
DELETE FROM `detail_barangmasuk`
WHERE `detfaktur` = '6a89df35f6e87e8f72a7b995909a16ecb41ef02d'
DELETE FROM `barangmasuk`
WHERE `faktur` IN ('6a89df35f6e87e8f72a7b995909a16ecb41ef02d')