app/Controllers/Barangkeluar.php

DELETE FROM `temp_barangkeluar`
WHERE `id` IN ('10')
---
    public function hapusItem()  {
        $id = $this->request->getPost('id');

        $modelTempBarangKeluar = new ModelTempBarangKeluar();
        $modelTempBarangKeluar->delete($id);