app/Controllers/Barang.php

    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');

        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            session()->set('cari_barang',$cari);
            redirect()->to('/barang/index');
        }else{
            $cari = session() ->get('cari_barang');
        }


        //method from modelbarang
        $totalData = $cari? $this->barang->tampildata_cari($cari)->countAllResults() :$this->barang->tampildata()->countAllResults();


        $dataBarang = $cari? $this->barang->tampildata_cari($cari)->paginate(10,'barang') :$this->barang->tampildata()->paginate(10,'barang');
---
SELECT COUNT(*) AS `numrows`
FROM `barang`
JOIN `kategori` ON `brgkatid`=`katid`
JOIN `satuan` ON `brgsatid`=`satid`
SELECT *
FROM `barang`
JOIN `kategori` ON `brgkatid`=`katid`
JOIN `satuan` ON `brgsatid`=`satid`
 LIMIT 10