app/Controllers/Kategori.php

SELECT *
FROM `kategori`
 LIMIT 10, 5
SELECT COUNT(*) AS `numrows`
FROM `kategori`
---
    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');

        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            session()->set('cari_kategori',$cari);
            redirect()->to('/kategori/index');
        }else{
            $cari = session() ->get('cari_kategori');
        }

        //var datakategori apakah carinya ada kalau ada cari data dengan method
        //yang ada di modelkategori
        $dataKategori = $cari? $this->kategori->cariData($cari)->paginate(5,'kategori') :$this->kategori->paginate(5,'kategori');