app/Controllers/Pelanggan.php

DELETE FROM `pelanggan`
WHERE `pelid` IN ('1')
---
    public function hapus(){
        if($this->request->isAJAX()){
            $id = $this->request->getPost('id');

            $modelPelanggan = new ModelPelanggan();

            $modelPelanggan->delete($id);