app/Controllers/Satuan.php

SELECT *
FROM `satuan`
WHERE `satuan`.`satid` = '1'
---
    public function formedit($id){
        $rowdata = $this->satuan->find($id);