app/Models/Modelbarangmasuk.php

    public function cekFaktur($faktur)  {
        return $this->table('barangmasuk')->getWhere([
            'sha1(faktur)'=>$faktur
        ]);
---
SELECT *
FROM `barangmasuk`
WHERE sha1(faktur) = 'debac0cf3be5958b721838e2ceac68f6f7c31903'

    public function laporanPerPeriode($tglawal,$tglakhir)
    {
        return $this->table('barangmasuk')->where('tglfaktur >=',$tglawal)
        ->where('tglfaktur <=',$tglakhir)->get();
---
SELECT *
FROM `barangmasuk`
WHERE `tglfaktur` >= '2023-10-26'
AND `tglfaktur` <= '2023-10-27'