app/Models/ModelDetailBarangKeluar.php

    public function tampilDataTemp($nofaktur) {
        return $this->table('detail_barangkeluar')
        ->join('barang','detbrgkode=brgkode')
        ->join('satuan','brgsatid=satid')
        ->where('detfaktur',$nofaktur)->get();
---
SELECT *
FROM `detail_barangkeluar`
JOIN `barang` ON `detbrgkode`=`brgkode`
JOIN `satuan` ON `brgsatid`=`satid`
WHERE `detfaktur` = '1810230008'