app/Models/Modelbarang.php

SELECT *
FROM `barang`
JOIN `kategori` ON `brgkatid`=`katid`
JOIN `satuan` ON `brgsatid`=`satid`
---
    public function tampildata() {
        return $this->table('barang')->join('kategori')