app/Models/ModelDataBarangKeluar.php

    public function count_all($tglawal,$tglakhir)
    {
        if($tglawal =='' && $tglakhir == ''){
            //dia pakai left join supaya semua data mucul termasuk yang tidak ada data pelanggannya
            $tbl_storage = $this->db->table($this->table)->join('pelanggan','idpel=pelid','left');
        }else{
            $tbl_storage = $this->db->table($this->table)->join('pelanggan','idpel=pelid','left')
            ->where('tglfaktur >=',$tglawal)
            ->where('tglfaktur <=',$tglakhir);
        }
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barangkeluar`
LEFT JOIN `pelanggan` ON `idpel`=`pelid`