app/Models/Modeldetailbarangmasuk.php

    public function ambilTotalHarga($faktur)  {
        $query = $this->table('detail_barangmasuk')->getWhere([
            'detfaktur'=>$faktur
        ]);
---
SELECT *
FROM `detail_barangmasuk`
WHERE `detfaktur` = 'f03'