app/Models/Modeltempbarangmasuk.php

SELECT *
FROM `temp_barangmasuk`
JOIN `barang` ON `brgkode`=`detbrgkode`
WHERE `detfaktur` = ''
---
    public function tampilDataTemp($faktur)  {
        return $this->table('temp_barangmasuk')->join('barang','brgkode=detbrgkode')->where([
            'detfaktur'=>$faktur
        ])->get();