app/Models/ModelTempBarangKeluar.php

    public function tampilDataTemp($nofaktur) {
        return $this->table('temp_barangkeluar')->join('barang','detbrgkode=brgkode')->where('detfaktur',$nofaktur)->get();
---
SELECT *
FROM `temp_barangkeluar`
JOIN `barang` ON `detbrgkode`=`brgkode`
WHERE `detfaktur` = '1710230001'