app/Models/ModelDataBarang.php

    function count_filtered()
    {
        $this->_get_datatables_query();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barang`

    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barang`